case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (25 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (25 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    body
    {
        type            noSlip;
    }

    bottom
    {
        type            noSlip;
    }

    top
    {
        type            slip;
    }

    side1
    {
         type           slip;
    }

    side2
    {
          type          slip;
    }

}

// ************************************************************************* //
