case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.094;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.094;
    }
    outlet
    {
        type            zeroGradient;
    }

    body
    {
        type            kqRWallFunction;
        value           uniform 0.094;
    }

    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.094;
    }

    top
    {
        type            zeroGradient;
    }

    side1
    {
         type           zeroGradient;
    }

    side2
    {
         type           zeroGradient;
     }

}

// ************************************************************************* //
