case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    body
    {
        type            wall;
        physicalType    patch;
        nFaces          1216;
        startFace       77192;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          292;
        startFace       78408;
    }
    side1
    {
        type            patch;
        physicalType    patch;
        nFaces          1028;
        startFace       78700;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          1028;
        startFace       79728;
    }
    side2
    {
        type            patch;
        physicalType    patch;
        nFaces          1028;
        startFace       80756;
    }
    bottom
    {
        type            wall;
        physicalType    patch;
        nFaces          1996;
        startFace       81784;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          292;
        startFace       83780;
    }
)

// ************************************************************************* //
